---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.BoundaryLinesIntersect
source: html/64b0df6a-92d0-4b62-7837-9d50d359c115.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.BoundaryLinesIntersect Property

Boundary lines intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId BoundaryLinesIntersect { get; }
```